<template>
  <div class="px-4 py-4 main text__content">
    <div class="d-flex align-center">
      <return-back routeName="profile"/>
      <h4 class="flex-shrink-1 flex-grow-1">Условия пользования</h4>
    </div>
    <div class="text__content__content mt-8">
      <h5 class="mb-3">Условия пользования</h5>
      <p>Если Вы еще не достигли требуемого возраста для управления аккаунтом Google, то можете использовать его
        только с разрешения родителя или законного представителя. Для этого родителю или законному представителю нужно
        прочитать эти условия вместе с Вами.
        <br>

        Если Вы являетесь родителем или законным представителем ребенка и позволяете ему использовать сервисы Google,
        настоящие условия относятся к Вам и Вы несете ответственность за действия ребенка в наших сервисах.
        <br>
        Для некоторых сервисов Google установлены особые возрастные ограничения. Они указаны в дополнительных правилах
        и условиях использования отдельных сервисов.</p>
      <h5 class="mt-14 mb-3">Предоставляем широкий выбор полезных сервисов</h5>
      <p>Мы предоставляем широкий спектр сервисов, для которых действуют настоящие условия, в том числе:
        приложения и сайты (например, Поиск и Карты);
        платформы (например, Google Покупки);
        интегрированные сервисы (например, встроенные Карты в приложениях или на сайтах других компаний);
        устройства (например, Google Nest).
        Многие из этих сервисов содержат контент, который Вы можете воспроизводить онлайн или с которым можете
        взаимодействовать.
        <br>
        Все наши сервисы работают совместно, чтобы Вам было легче переключаться между задачами. Например, если для
        мероприятия в Календаре указан адрес, Вы можете нажать на этот адрес и увидеть в Картах маршрут до этого
        места.
        <br>
        Мы постоянно разрабатываем новые технологии и функции для улучшения наших сервисов. Например, мы используем
        системы искусственного интеллекта и машинное обучение, чтобы предоставлять пользователям возможности
        мгновенного перевода, а также лучше обнаруживать и блокировать спам и вредоносное ПО. В рамках непрерывного
        совершенствования мы иногда добавляем или удаляем некоторые функции, расширяем или сужаем ограничения по
        использованию наших сервисов, а также запускаем новые сервисы или прекращаем поддержку старых. Если для работы
        сервиса необходимо скачать программное обеспечение, оно может автоматически обновляться на Вашем устройстве
        при появлении очередной его версии или внедрении новой функции. В некоторых сервисах можно настраивать
        параметры автоматического обновления.</p>
    </div>
  </div>
</template>

<script setup>
import ReturnBack from "@/components/ReturnBack.vue";

</script>